[CommsScientistStaffSlot X2StaffSlotTemplate]
EmptyText="OPEN: SCIENTIST REQUIRED"
BonusEmptyText="Increases Scanning Rate."
BonusText="SCANNING RATE +100%"
FilledText="%UNITNAME is using the communications system to scan the area!"
LockedText="LOCKED: PURCHASE UPGRADE"
;Place localized text in this file

[WorkshopScientistStaffSlot X2StaffSlotTemplate]
EmptyText="OPEN: SCIENTIST REQUIRED"
BonusEmptyText="Provides Staffing GREMLINs."
BonusText="+%SKILL STAFFING GREMLINS"
FilledText="%UNITNAME is building special GREMLINs, allowing adjacent rooms to be staffed!"
GhostName="Scientist GREMLIN"
LockedText="LOCKED: PURCHASE UPGRADE"

[ProvingGroundScientistStaffSlot X2StaffSlotTemplate]
EmptyText="OPEN: SCIENTIST REQUIRED"
BonusEmptyText="Automates projects."
BonusText="Automating projects"
FilledText="When a project is completed with %UNITNAME present, all future projects of that type will be completed instantly."
LockedText="LOCKED: PURCHASE UPGRADE"